In [44]:
import pandas as pd
import numpy as np
from random import randint,choice

In [46]:
class Person:
    def __init__(self,first_name,last_name,id,department_id,salary=0):
        self.first_name = first_name
        self.last_name = last_name
        self.id=id
        self.department_id = department_id
        self.salary=salary
    def toString(self):
        return self.first_name+" "+self.last_name+" "+str(self.id)+" "+str(self.department_id)+" "+str(self.salary)

In [83]:
#generate a list of 10 Persons
def generate_persons():
    first_names = ['John','Jane','Jack','Jill','Joe','Jen','Jenny','Jenna','Jesse','Jasper']
    last_names = ['Smith','Johnson','Williams','Brown','Jones','Miller','Davis','Garcia','Rodriguez','Wilson']
    ids = np.arange(1,11)
    department_ids = np.random.randint(1,10,10)
    persons = []
    for i in range(10):
        persons.append(Person(first_names[i],last_names[i],ids[i],department_ids[i]))
    return persons
persons=generate_persons()
#print persons tostring for each person

dic={
    'id':[],
    'first_name':[],
    'last_name':[],
    'department_id':[],
    'salary':[]
    
}
for i in range(10000):
    person = choice(persons)
    person.salary = randint(1000,100000)
    dic['id'].append(person.id)
    dic['first_name'].append(person.first_name)
    dic['last_name'].append(person.last_name)
    dic['department_id'].append(person.department_id)
    dic['salary'] .append(person.salary)
df = pd.DataFrame(dic)
#get the max salary for each person

array([4906, 5190, 5321, 6724, 4862,  564, 6327, 6472, 4930, 8827],
      dtype=int64)

In [87]:
df1=df.sort_values('salary').drop_duplicates(['first_name', 'last_name'], keep='last')
df1.sort_values('id')

      id first_name  last_name  department_id  salary
8827   1       John      Smith              2   99925
5190   2       Jane    Johnson              3   99837
4906   3       Jack   Williams              6   99993
6472   4       Jill      Brown              1   99968
4930   5        Joe      Jones              9   99937
6724   6        Jen     Miller              4   99993
564    7      Jenny      Davis              2   99985
4862   8      Jenna     Garcia              8   99782
6327   9      Jesse  Rodriguez              6   99940
5321  10     Jasper     Wilson              5   99942